Tekla.Structures.Drawing.DimensionLink
The DimensionLink class contains methods related to dimension links.
A dimension link is a link between two dimension sets.
The following example creates two dimensions in the drawing sheet and links them:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if (MyDrawingHandler.GetConnectionStatus())
{
StraightDimension Dimension1 = new StraightDimension(MyDrawingHandler.GetActiveDrawing().GetSheet(),
new Point(0, 0, 0), new Point(100, 0, 0), new Vector(0, -1, 0), 100.0);
StraightDimension Dimension2 = new StraightDimension(MyDrawingHandler.GetActiveDrawing().GetSheet(),
new Point(0, 0, 0), new Point(0, 100, 0), new Vector(-1, 0, 0), 100.0);
Dimension1.Insert();
Dimension2.Insert();
StraightDimensionSet DimSet1 = Dimension1.GetDimensionSet() as StraightDimensionSet;
StraightDimensionSet DimSet2 = Dimension2.GetDimensionSet() as StraightDimensionSet;
DimensionLink DimLink = new DimensionLink(DimSet1, DimSet2);
DimLink.Insert();
}
}
}

Tekla.Structures.Drawing.DimensionLink.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.DimensionLink.#ctor(Tekla.Structures.Drawing.StraightDimensionSet,Tekla.Structures.Drawing.StraightDimensionSet)
Creates a new DimensionLink instance.
Dimension1: The first dimension set to be linked.
Dimension2: The second dimension set to be linked.

Tekla.Structures.Drawing.DimensionLink.GetDimension1
Gets the first one of the linked dimensions.
Returns: The first one of the linked dimensions.

Tekla.Structures.Drawing.DimensionLink.GetDimension2
Gets the second one of the linked dimensions.
Returns: The second one of the linked dimensions.

Tekla.Structures.Drawing.DimensionLink.Delete
Unlinks the dimensions in the current drawing.
Returns: True on success.

Tekla.Structures.Drawing.DimensionLink.Modify
NOT YET IMPLEMENTED.
Returns: False.

Tekla.Structures.Drawing.DimensionLink.Insert
Links the dimensions in the drawing.
Returns: True on success.

Tekla.Structures.Drawing.DimensionLink.Select
Selects the drawing DimensionLink from the current drawing database.
Returns: True on success.